* Aggregate functions -> min, max, mean, median and so on.

In [18]:
import pandas as pd
import numpy as np
from random import shuffle

In [19]:
pg = ['A','B','C','D'] * 25
supplier = ['S1','S2'] * 50
shuffle(pg)
shuffle(supplier)

In [28]:
df = pd.DataFrame({'product_code':np.arange(100,200),
                  'product_group':pg,
                  'supplier':supplier,
                  'price':np.round(np.random.rand(100)*5,2),
                  'sales_qty':np.random.randint(10,200, size=100)})
df.head()

   product_code product_group supplier  price  sales_qty
0           100             C       S2   0.86         57
1           101             B       S1   3.29        132
2           102             B       S2   3.65        199
3           103             A       S2   4.34        116
4           104             D       S2   4.93        145

In [29]:
df[['price','sales_qty']].mean()

price          2.5493
sales_qty    101.7500
dtype: float64

In [30]:
# multiple aggregation with a single column

df['price'].apply(['sum','min','max'])

sum    254.93
min      0.00
max      4.99
Name: price, dtype: float64

In [32]:
# multiple aggregation with multiple columns

df[['price','sales_qty']].apply(['mean','median'])

         price  sales_qty
mean    2.5493     101.75
median  2.7500     103.00

In [34]:
# different aggregate functions with different columns
# way-1

df.aggregate({'price':['sum','min','max','mean'],
             'sales_qty':['sum','mean','max']})

         price  sales_qty
sum   254.9300   10175.00
min     0.0000        NaN
max     4.9900     199.00
mean    2.5493     101.75

In [36]:
# different aggregate functions with different columns
# way-2

df[['price','sales_qty']].apply({'price':'mean',
                                'sales_qty':'median'})

price          2.5493
sales_qty    103.0000
dtype: float64

In [37]:
# different aggregate functions with different columns
# way-3 using agg() function

df[['price','sales_qty']].apply(['mean','median'])

         price  sales_qty
mean    2.5493     101.75
median  2.7500     103.00

* The agg function also allows for assigning customized names to the aggregated columns (named aggregation)

In [38]:
df[['price','sales_qty']].agg(avg_price=('price','mean'),
                             max_price=('price','max'),
                             median_value=('sales_qty','median'))

               price  sales_qty
avg_price     2.5493        NaN
max_price     4.9900        NaN
median_value     NaN      103.0

In [40]:
# named aggregation useful when working with groupby function

df.groupby('product_group').agg(avg_price=('price','mean'),
                             max_price=('price','max'),
                             median_value=('sales_qty','median'),
                               product_count=('product_code','count'))

               avg_price  max_price  median_value  product_count
product_group
A                 2.3468       4.73         116.0             25
B                 2.8236       4.99         115.0             25
C                 2.4960       4.68          93.0             25
D                 2.5308       4.93          80.0             25

* Using describe() function we can get different types of aggregations in our output

In [41]:
df[['price','sales_qty']].describe()

            price   sales_qty
count  100.000000  100.000000
mean     2.549300  101.750000
std      1.542646   53.736427
min      0.000000   11.000000
25%      1.172500   56.500000
50%      2.750000  103.000000
75%      4.000000  144.250000
max      4.990000  199.000000